#include <Servo.h>  // เรียกใช้ไลบรารี Servo

Servo myServo;      // สร้างวัตถุ Servo
int potPin = A0;    // ขาอนาล็อกที่เชื่อมต่อตัวต้านทานปรับค่าได้
int val;            // ตัวแปรสำหรับเก็บค่าที่อ่านจากตัวต้านทานปรับค่าได้

void setup() {
  myServo.attach(9);  // เชื่อมต่อเซอร์โวมอเตอร์กับขา 9 ของ Arduino
}

void loop() {
  val = analogRead(potPin);           // อ่านค่าจากตัวต้านทานปรับค่าได้
  val = map(val, 0, 1023, 0, 180);    // แปลงค่าจาก 0-1023 เป็นมุม 0-180 องศา
  myServo.write(val);                 // ตั้งตำแหน่งเซอร์โวมอเตอร์ตามค่า val
  delay(15);                          // หน่วงเวลาสักครู่เพื่อให้การเคลื่อนไหวของเซอร์โวมอเตอร์นุ่มนวล
}
